#+STARTUP: folded indent
#+PROPERTY: header-args:R :results output :colnames yes :session *R:lintr*

* ライブラリの読み込みとバージョンの確認

#+begin_src R :results silent
library(tidyverse)
library(lintr)
#+end_src

- バージョン
#+begin_src R :exports both
packageVersion("lintr")
#+end_src

#+RESULTS:
: [1] ‘2.0.0’

* 全関数リスト

#+begin_src R
pacman::p_funs(lintr)
#+end_src

#+RESULTS:
#+begin_example
 [1] "absolute_path_linter"             "absolute_paths_linter"           
 [3] "all_undesirable_functions"        "all_undesirable_operators"       
 [5] "assignment_linter"                "camel_case_linter"               
 [7] "checkstyle_output"                "clear_cache"                     
 [9] "closed_curly_linter"              "commas_linter"                   
[11] "commented_code_linter"            "cyclocomp_linter"                
[13] "default_linters"                  "default_settings"                
[15] "default_undesirable_functions"    "default_undesirable_operators"   
[17] "equals_na_linter"                 "expect_lint"                     
[19] "expect_lint_free"                 "extraction_operator_linter"      
[21] "function_left_parentheses_linter" "get_source_expressions"          
[23] "ids_with_token"                   "implicit_integer_linter"         
[25] "infix_spaces_linter"              "line_length_linter"              
[27] "lint"                             "Lint"                            
[29] "lint_dir"                         "lint_package"                    
[31] "multiple_dots_linter"             "no_tab_linter"                   
[33] "nonportable_path_linter"          "object_length_linter"            
[35] "object_name_linter"               "object_usage_linter"             
[37] "open_curly_linter"                "paren_brace_linter"              
[39] "pipe_continuation_linter"         "semicolon_terminator_linter"     
[41] "seq_linter"                       "single_quotes_linter"            
[43] "snake_case_linter"                "spaces_inside_linter"            
[45] "spaces_left_parentheses_linter"   "T_and_F_symbol_linter"           
[47] "todo_comment_linter"              "trailing_blank_lines_linter"     
[49] "trailing_semicolons_linter"       "trailing_whitespace_linter"      
[51] "undesirable_function_linter"      "undesirable_operator_linter"     
[53] "unneeded_concatenation_linter"    "with_defaults"                   
[55] "with_id"
#+end_example

- Total 37 linters
#+begin_src R
pacman::p_funs(lintr) %>% stringr::str_subset("linter$")
#+end_src

#+RESULTS:
#+begin_example
 [1] "absolute_path_linter"             "absolute_paths_linter"           
 [3] "assignment_linter"                "camel_case_linter"               
 [5] "closed_curly_linter"              "commas_linter"                   
 [7] "commented_code_linter"            "cyclocomp_linter"                
 [9] "equals_na_linter"                 "extraction_operator_linter"      
[11] "function_left_parentheses_linter" "implicit_integer_linter"         
[13] "infix_spaces_linter"              "line_length_linter"              
[15] "multiple_dots_linter"             "no_tab_linter"                   
[17] "nonportable_path_linter"          "object_length_linter"            
[19] "object_name_linter"               "object_usage_linter"             
[21] "open_curly_linter"                "paren_brace_linter"              
[23] "pipe_continuation_linter"         "semicolon_terminator_linter"     
[25] "seq_linter"                       "single_quotes_linter"            
[27] "snake_case_linter"                "spaces_inside_linter"            
[29] "spaces_left_parentheses_linter"   "T_and_F_symbol_linter"           
[31] "todo_comment_linter"              "trailing_blank_lines_linter"     
[33] "trailing_semicolons_linter"       "trailing_whitespace_linter"      
[35] "undesirable_function_linter"      "undesirable_operator_linter"     
[37] "unneeded_concatenation_linter"
#+end_example

* 実行環境

#+begin_src R :results output :exports both
sessionInfo()
#+end_src

#+RESULTS:
#+begin_example
R version 3.6.1 (2019-07-05)
Platform: x86_64-pc-linux-gnu (64-bit)
Running under: Ubuntu 18.04.3 LTS

Matrix products: default
BLAS:   /usr/lib/x86_64-linux-gnu/blas/libblas.so.3.7.1
LAPACK: /usr/lib/x86_64-linux-gnu/lapack/liblapack.so.3.7.1

locale:
 [1] LC_CTYPE=en_US.UTF-8       LC_NUMERIC=C
 [3] LC_TIME=en_US.UTF-8        LC_COLLATE=en_US.UTF-8
 [5] LC_MONETARY=en_US.UTF-8    LC_MESSAGES=en_US.UTF-8
 [7] LC_PAPER=en_US.UTF-8       LC_NAME=C
 [9] LC_ADDRESS=C               LC_TELEPHONE=C
[11] LC_MEASUREMENT=en_US.UTF-8 LC_IDENTIFICATION=C

attached base packages:
[1] stats     graphics  grDevices utils     datasets  methods   base

other attached packages:
[1] lintr_1.0.3

loaded via a namespace (and not attached):
[1] compiler_3.6.1 lazyeval_0.2.2 magrittr_1.5   tools_3.6.1    rex_1.1.2
[6] pacman_0.5.1
#+end_example
\\

